In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [3]:
sozluk = {"veri1":s1, "veri2":s2, "veri3":s3}
sozluk

{'veri1': array([4, 1, 6, 5, 3]),
 'veri2': array([0, 2, 0, 7, 9]),
 'veri3': array([4, 4, 0, 7, 0])}

In [4]:
df = pd.DataFrame(sozluk)
df

   veri1  veri2  veri3
0      4      0      4
1      1      2      4
2      6      0      0
3      5      7      7
4      3      9      0

In [5]:
df[0:2]

   veri1  veri2  veri3
0      4      0      4
1      1      2      4

In [6]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.index = ["a","b","c","d","e"]
df

   veri1  veri2  veri3
a      4      0      4
b      1      2      4
c      6      0      0
d      5      7      7
e      3      9      0

In [8]:
df["c":"e"]

   veri1  veri2  veri3
c      6      0      0
d      5      7      7
e      3      9      0

silme

In [9]:
df.drop("a",axis=0)

   veri1  veri2  veri3
b      1      2      4
c      6      0      0
d      5      7      7
e      3      9      0

In [10]:
df

   veri1  veri2  veri3
a      4      0      4
b      1      2      4
c      6      0      0
d      5      7      7
e      3      9      0

In [11]:
df.drop("a",axis=0, inplace=True)
df

   veri1  veri2  veri3
b      1      2      4
c      6      0      0
d      5      7      7
e      3      9      0

In [12]:
df.drop(["c","d"])

   veri1  veri2  veri3
b      1      2      4
e      3      9      0

fancy

In [13]:
l = ["c","e"]

In [14]:
df.drop(l)

   veri1  veri2  veri3
b      1      2      4
d      5      7      7

degiskenler i√ßin

In [15]:
"veri1" in df

True

In [16]:
l = ["veri1", "veri5", "veri2"]

In [17]:
for i in l:
    print(i in df)

True
False
True

In [18]:
df.veri2 * 4

b     8
c     0
d    28
e    36
Name: veri2, dtype: int32

In [19]:
df

   veri1  veri2  veri3
b      1      2      4
c      6      0      0
d      5      7      7
e      3      9      0

In [20]:
df["veri4"] = df.veri2 * 2
df

   veri1  veri2  veri3  veri4
b      1      2      4      4
c      6      0      0      0
d      5      7      7     14
e      3      9      0     18

In [23]:
df.drop("veri4", axis=1)

   veri1  veri2  veri3
b      1      2      4
c      6      0      0
d      5      7      7
e      3      9      0